Optify-Oberflaechen/Files/request_bestellungoeffnen.xml

<?xml version="1.0" encoding="UTF-8"?>
	<!-- Generiert mit dem WSDL2B4A-Generator Version 1.1 und unter GPL 3 zur Verfuegung gestellt.-->
	<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
		<s:Body>
			<BestellungOeffnen xmlns="http://tempuri.org/">
				<pintBestID>$PINTBESTID$</pintBestID>
			</BestellungOeffnen>
		</s:Body>
	</s:Envelope>
